; ModuleID = './Build/OvmfX64/DEBUG_CLANGPDB/X64/EmulatorPkg/Demo1_Bob/Demo1_Bob/OUTPUT/Demo1_Bob.obj'
source_filename = "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2/EmulatorPkg/Demo1_Bob/Demo1_Bob.c"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-windows-gnu"

%struct._Demo1_Bob_PROTOCOL = type { {}* }
%struct._Demo1_Access_Key_PROTOCOL = type { i64 (%struct._Demo1_Access_Key_PROTOCOL*, i8*, i8, %struct._DEMO1_ACCESS_KEY*)*, i64 (%struct._Demo1_Access_Key_PROTOCOL*, i8*, %struct._DEMO1_ACCESS_KEY*, i8, i8*)*, i8* }
%struct._DEMO1_ACCESS_KEY = type { [2 x i64] }
%struct._Demo1_Alice_PROTOCOL = type { i64 (%struct._Demo1_Alice_PROTOCOL*, i8*, i64*)*, i8* }
%struct.EFI_LOADED_IMAGE_PROTOCOL = type { i32, i8*, %struct.EFI_SYSTEM_TABLE*, i8*, %struct.EFI_DEVICE_PATH_PROTOCOL*, i8*, i32, i8*, i8*, i64, i32, i32, i64 (i8*)* }
%struct.EFI_SYSTEM_TABLE = type { %struct.EFI_TABLE_HEADER, i16*, i32, i8*, %struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, i8*, %struct._EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL*, %struct.EFI_RUNTIME_SERVICES*, %struct.EFI_BOOT_SERVICES*, i64, %struct.EFI_CONFIGURATION_TABLE* }
%struct.EFI_TABLE_HEADER = type { i64, i32, i32, i32, i32 }
%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL = type { i64 (%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, i8)*, i64 (%struct._EFI_SIMPLE_TEXT_INPUT_PROTOCOL*, %struct.EFI_INPUT_KEY*)*, i8* }

!30 = !DIEnumerator(name: "EfiUnusableMemory", value: 8, isUnsigned: true)
!31 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9, isUnsigned: true)
!32 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10, isUnsigned: true)
!33 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11, isUnsigned: true)
!34 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12, isUnsigned: true)
!35 = !DIEnumerator(name: "EfiPalCode", value: 13, isUnsigned: true)
!36 = !DIEnumerator(name: "EfiPersistentMemory", value: 14, isUnsigned: true)
!37 = !DIEnumerator(name: "EfiMaxMemoryType", value: 15, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 507, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "TimerCancel", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "TimerPeriodic", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "TimerRelative", value: 2, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1230, baseType: !7, size: 32, elements: !44)
!44 = !{!45}
!45 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 1546, baseType: !7, size: 32, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIEnumerator(name: "AllHandles", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "ByRegisterNotify", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "ByProtocol", value: 2, isUnsigned: true)
!51 = !{!52, !53, !54, !58, !63, !65, !61, !60, !71, !73}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !55, line: 234, baseType: !56)
!55 = !DIFile(filename: "MdePkg/Include/X64/ProcessorBind.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "5a809246aab9e079e163aa7a7e32c6ad")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !55, line: 184, baseType: !57)
!57 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !59, line: 929, baseType: !60)
!59 = !DIFile(filename: "MdePkg/Include/Base.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "3f6266abff5139355a71d79133d24209")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !55, line: 229, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !55, line: 180, baseType: !62)
!62 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !55, line: 210, baseType: !64)
!64 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT_NOTIFY", file: !14, line: 443, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !53}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EVENT", file: !70, line: 39, baseType: !53)
!70 = !DIFile(filename: "MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "90811c8655f5f5234087d76d7333a72d")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!74 = !{!0, !75, !106, !119, !121, !123, !652, !654, !656, !658}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "AccessKeyProtocol", scope: !2, file: !77, line: 24, type: !78, isLocal: false, isDefinition: true)
!77 = !DIFile(filename: "EmulatorPkg/Demo1_Bob/Demo1_Bob.c", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "4c096714e87d991af795235310c55912")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Access_Key_PROTOCOL", file: !80, line: 36, baseType: !81)
!80 = !DIFile(filename: "EmulatorPkg/Demo1_Bob/../Demo1_Access_Key/Demo1_Access_Key.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "3299ebea88bb79b43dbbdfacf1997d4b")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Access_Key_PROTOCOL", file: !80, line: 79, size: 192, elements: !82)
!82 = !{!83, !99, !105}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1GenerateAccessKey", scope: !81, file: !80, line: 80, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRVR_FUNC_CB_TYPE1", file: !80, line: 58, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !78, !89, !63, !90}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !70, line: 31, baseType: !58)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !70, line: 35, baseType: !53)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEMO1_ACCESS_KEY", file: !70, line: 23, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_DEMO1_ACCESS_KEY", file: !59, line: 225, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DEMO1_ACCESS_KEY", file: !59, line: 223, size: 128, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "access_key_store", scope: !93, file: !59, line: 224, baseType: !96, size: 128)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 2)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1ValidateAccessKey", scope: !81, file: !80, line: 81, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "DRVR_FUNC_CB_TYPE2", file: !80, line: 68, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!88, !78, !89, !90, !63, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1_Ready_To_Lock_Event", scope: !81, file: !80, line: 82, baseType: !69, size: 64, offset: 128)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "AliceProtocol", scope: !2, file: !77, line: 25, type: !108, isLocal: false, isDefinition: true)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Alice_PROTOCOL", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "EmulatorPkg/Demo1_Bob/../Demo1_Alice/Demo1_Alice.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "00b73d58882c8bc787555d71ef8113b1")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Alice_PROTOCOL", file: !110, line: 66, size: 128, elements: !112)
!112 = !{!113, !118}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1AliceProvideData", scope: !111, file: !110, line: 67, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALICE_CB_TYPE", file: !110, line: 57, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!88, !108, !89, !73}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1_Ready_To_Run_Event", scope: !111, file: !110, line: 68, baseType: !69, size: 64, offset: 64)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "Demo1_Bob_PeriodicTimer", scope: !2, file: !77, line: 29, type: !69, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "DataToProvide", scope: !2, file: !77, line: 30, type: !60, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "gLoadImage", scope: !2, file: !77, line: 31, type: !125, isLocal: false, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !127, line: 72, baseType: !128)
!127 = !DIFile(filename: "MdePkg/Include/Protocol/LoadedImage.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "0bfc90f5c05009801c3af3d54bff9caa")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_LOADED_IMAGE_PROTOCOL", file: !127, line: 43, size: 768, elements: !129)
!129 = !{!130, !132, !133, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !128, file: !127, line: 44, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !55, line: 188, baseType: !7)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ParentHandle", scope: !128, file: !127, line: 46, baseType: !89, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "SystemTable", scope: !128, file: !127, line: 48, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SYSTEM_TABLE", file: !14, line: 2130, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SYSTEM_TABLE", file: !14, line: 2069, size: 960, elements: !137)
!137 = !{!138, !147, !151, !152, !153, !177, !178, !233, !234, !235, !382, !634, !635}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !136, file: !14, line: 2073, baseType: !139, size: 192)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !6, line: 172, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TABLE_HEADER", file: !6, line: 145, size: 192, elements: !141)
!141 = !{!142, !143, !144, !145, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !140, file: !6, line: 151, baseType: !61, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !140, file: !6, line: 158, baseType: !131, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !140, file: !6, line: 162, baseType: !131, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !140, file: !6, line: 167, baseType: !131, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !140, file: !6, line: 171, baseType: !131, size: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareVendor", scope: !136, file: !14, line: 2078, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !55, line: 201, baseType: !150)
!150 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "FirmwareRevision", scope: !136, file: !14, line: 2083, baseType: !131, size: 32, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleInHandle", scope: !136, file: !14, line: 2088, baseType: !89, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ConIn", scope: !136, file: !14, line: 2093, baseType: !154, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !156, line: 20, baseType: !157)
!156 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextIn.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "239cf4f3dddb25a8596c70fa738413fd")
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_INPUT_PROTOCOL", file: !156, line: 116, size: 192, elements: !158)
!158 = !{!159, !164, !176}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !157, file: !156, line: 117, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_RESET", file: !156, line: 86, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!88, !154, !63}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ReadKeyStroke", scope: !157, file: !156, line: 118, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_READ_KEY", file: !156, line: 107, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!88, !154, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INPUT_KEY", file: !156, line: 38, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_INPUT_KEY", file: !156, line: 35, size: 32, elements: !172)
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ScanCode", scope: !171, file: !156, line: 36, baseType: !174, size: 16)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !55, line: 196, baseType: !150)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "UnicodeChar", scope: !171, file: !156, line: 37, baseType: !149, size: 16, offset: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForKey", scope: !157, file: !156, line: 122, baseType: !69, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ConsoleOutHandle", scope: !136, file: !14, line: 2097, baseType: !89, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ConOut", scope: !136, file: !14, line: 2102, baseType: !179, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !181, line: 27, baseType: !182)
!181 = !DIFile(filename: "MdePkg/Include/Protocol/SimpleTextOut.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "685bec042927ad46d31bf42ae7f6ddcd")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SIMPLE_TEXT_OUTPUT_PROTOCOL", file: !181, line: 387, size: 640, elements: !183)
!183 = !{!184, !189, !194, !196, !201, !206, !208, !213, !218, !220}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Reset", scope: !182, file: !181, line: 388, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_RESET", file: !181, line: 167, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!88, !179, !63}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "OutputString", scope: !182, file: !181, line: 390, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_STRING", file: !181, line: 192, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!88, !179, !148}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "TestString", scope: !182, file: !181, line: 391, baseType: !195, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_TEST_STRING", file: !181, line: 213, baseType: !191)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "QueryMode", scope: !182, file: !181, line: 393, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_QUERY_MODE", file: !181, line: 236, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!88, !179, !60, !73, !73}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "SetMode", scope: !182, file: !181, line: 394, baseType: !202, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_MODE", file: !181, line: 256, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!88, !179, !60}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "SetAttribute", scope: !182, file: !181, line: 395, baseType: !207, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_ATTRIBUTE", file: !181, line: 277, baseType: !203)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ClearScreen", scope: !182, file: !181, line: 397, baseType: !209, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_CLEAR_SCREEN", file: !181, line: 295, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!88, !179}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "SetCursorPosition", scope: !182, file: !181, line: 398, baseType: !214, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_SET_CURSOR_POSITION", file: !181, line: 318, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!88, !179, !60, !60}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "EnableCursor", scope: !182, file: !181, line: 399, baseType: !219, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TEXT_ENABLE_CURSOR", file: !181, line: 340, baseType: !186)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !182, file: !181, line: 404, baseType: !221, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !181, line: 379, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_SIMPLE_TEXT_OUTPUT_MODE", file: !181, line: 349, size: 192, elements: !224)
!224 = !{!225, !228, !229, !230, !231, !232}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "MaxMode", scope: !223, file: !181, line: 353, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !55, line: 192, baseType: !227)
!227 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !223, file: !181, line: 362, baseType: !226, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !223, file: !181, line: 366, baseType: !226, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "CursorColumn", scope: !223, file: !181, line: 370, baseType: !226, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "CursorRow", scope: !223, file: !181, line: 374, baseType: !226, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CursorVisible", scope: !223, file: !181, line: 378, baseType: !63, size: 8, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "StandardErrorHandle", scope: !136, file: !14, line: 2107, baseType: !89, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "StdErr", scope: !136, file: !14, line: 2112, baseType: !179, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeServices", scope: !136, file: !14, line: 2116, baseType: !236, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1948, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_RUNTIME_SERVICES", file: !14, line: 1899, size: 1216, elements: !239)
!239 = !{!240, !241, !271, !276, !281, !286, !302, !307, !325, !330, !335, !340, !345, !350, !356, !370, !377}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !238, file: !14, line: 1903, baseType: !139, size: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "GetTime", scope: !238, file: !14, line: 1908, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_TIME", file: !14, line: 887, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!88, !246, !264}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME", file: !70, line: 82, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME", file: !70, line: 70, size: 128, elements: !249)
!249 = !{!250, !251, !253, !254, !255, !256, !257, !258, !259, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Year", scope: !248, file: !70, line: 71, baseType: !174, size: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Month", scope: !248, file: !70, line: 72, baseType: !252, size: 8, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !55, line: 214, baseType: !64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Day", scope: !248, file: !70, line: 73, baseType: !252, size: 8, offset: 24)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Hour", scope: !248, file: !70, line: 74, baseType: !252, size: 8, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Minute", scope: !248, file: !70, line: 75, baseType: !252, size: 8, offset: 40)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Second", scope: !248, file: !70, line: 76, baseType: !252, size: 8, offset: 48)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Pad1", scope: !248, file: !70, line: 77, baseType: !252, size: 8, offset: 56)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Nanosecond", scope: !248, file: !70, line: 78, baseType: !131, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "TimeZone", scope: !248, file: !70, line: 79, baseType: !260, size: 16, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT16", file: !55, line: 205, baseType: !261)
!261 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Daylight", scope: !248, file: !70, line: 80, baseType: !252, size: 8, offset: 112)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Pad2", scope: !248, file: !70, line: 81, baseType: !252, size: 8, offset: 120)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIME_CAPABILITIES", file: !14, line: 870, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_TIME_CAPABILITIES", file: !14, line: 847, size: 96, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Resolution", scope: !266, file: !14, line: 854, baseType: !131, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Accuracy", scope: !266, file: !14, line: 861, baseType: !131, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "SetsToZero", scope: !266, file: !14, line: 869, baseType: !63, size: 8, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "SetTime", scope: !238, file: !14, line: 1909, baseType: !272, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIME", file: !14, line: 904, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!88, !246}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "GetWakeupTime", scope: !238, file: !14, line: 1910, baseType: !277, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_WAKEUP_TIME", file: !14, line: 925, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!88, !104, !104, !246}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "SetWakeupTime", scope: !238, file: !14, line: 1911, baseType: !282, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WAKEUP_TIME", file: !14, line: 947, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!88, !63, !246}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "SetVirtualAddressMap", scope: !238, file: !14, line: 1916, baseType: !287, size: 64, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VIRTUAL_ADDRESS_MAP", file: !14, line: 313, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!88, !60, !60, !131, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 161, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_MEMORY_DESCRIPTOR", file: !14, line: 129, size: 320, elements: !294)
!294 = !{!295, !296, !298, !300, !301}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !293, file: !14, line: 135, baseType: !131, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "PhysicalStart", scope: !293, file: !14, line: 141, baseType: !297, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !70, line: 52, baseType: !61)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "VirtualStart", scope: !293, file: !14, line: 147, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_VIRTUAL_ADDRESS", file: !70, line: 57, baseType: !61)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfPages", scope: !293, file: !14, line: 154, baseType: !61, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !293, file: !14, line: 160, baseType: !61, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ConvertPointer", scope: !238, file: !14, line: 1917, baseType: !303, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONVERT_POINTER", file: !14, line: 408, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!88, !60, !52}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "GetVariable", scope: !238, file: !14, line: 1922, baseType: !308, size: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !14, line: 672, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!88, !148, !312, !324, !73, !53}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !70, line: 27, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !59, line: 218, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GUID", file: !59, line: 213, size: 128, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !315, file: !59, line: 214, baseType: !131, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !315, file: !59, line: 215, baseType: !174, size: 16, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !315, file: !59, line: 216, baseType: !174, size: 16, offset: 48)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !315, file: !59, line: 217, baseType: !321, size: 64, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextVariableName", scope: !238, file: !14, line: 1923, baseType: !326, size: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !14, line: 746, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!88, !73, !148, !312}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "SetVariable", scope: !238, file: !14, line: 1924, baseType: !331, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !14, line: 788, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!88, !148, !312, !131, !60, !53}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "GetAccessVariable", scope: !238, file: !14, line: 1929, baseType: !336, size: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_ACCESS_VARIABLE", file: !14, line: 708, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!88, !148, !312, !324, !90, !73, !53, !89}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "SetAccessVariable", scope: !238, file: !14, line: 1930, baseType: !341, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_ACCESS_VARIABLE", file: !14, line: 833, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!88, !148, !312, !131, !90, !60, !53, !89}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextHighMonotonicCount", scope: !238, file: !14, line: 1935, baseType: !346, size: 64, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_HIGH_MONO_COUNT", file: !14, line: 1168, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!88, !324}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ResetSystem", scope: !238, file: !14, line: 1936, baseType: !351, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_SYSTEM", file: !14, line: 1133, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355, !88, !60, !53}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESET_TYPE", file: !6, line: 140, baseType: !5)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "UpdateCapsule", scope: !238, file: !14, line: 1941, baseType: !357, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UPDATE_CAPSULE", file: !14, line: 1794, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!88, !361, !60, !297}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CAPSULE_HEADER", file: !14, line: 1740, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CAPSULE_HEADER", file: !14, line: 1719, size: 224, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleGuid", scope: !364, file: !14, line: 1723, baseType: !313, size: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !364, file: !14, line: 1729, baseType: !131, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !364, file: !14, line: 1735, baseType: !131, size: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "CapsuleImageSize", scope: !364, file: !14, line: 1739, baseType: !131, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "QueryCapsuleCapabilities", scope: !238, file: !14, line: 1942, baseType: !371, size: 64, offset: 1088)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_CAPSULE_CAPABILITIES", file: !14, line: 1825, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!88, !361, !60, !375, !376}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "QueryVariableInfo", scope: !238, file: !14, line: 1947, baseType: !378, size: 64, offset: 1152)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !14, line: 1856, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!88, !131, !375, !375, !375}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "BootServices", scope: !136, file: !14, line: 2120, baseType: !383, size: 64, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_BOOT_SERVICES", file: !14, line: 2049, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_BOOT_SERVICES", file: !14, line: 1956, size: 3008, elements: !386)
!386 = !{!387, !388, !394, !399, !407, !412, !417, !422, !427, !433, !439, !444, !449, !451, !453, !460, !465, !470, !475, !476, !481, !487, !502, !507, !512, !518, !523, !528, !533, !538, !543, !548, !553, !558, !563, !568, !582, !589, !595, !600, !605, !610, !615, !620, !625}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !385, file: !14, line: 1960, baseType: !139, size: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "RaiseTPL", scope: !385, file: !14, line: 1965, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RAISE_TPL", file: !14, line: 630, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!393, !393}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TPL", file: !70, line: 43, baseType: !60)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "RestoreTPL", scope: !385, file: !14, line: 1966, baseType: !395, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_RESTORE_TPL", file: !14, line: 642, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !393}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePages", scope: !385, file: !14, line: 1971, baseType: !400, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !14, line: 189, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!88, !404, !405, !60, !406}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !14, line: 48, baseType: !13)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !6, line: 107, baseType: !20)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "FreePages", scope: !385, file: !14, line: 1972, baseType: !408, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !14, line: 210, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!88, !297, !60}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "GetMemoryMap", scope: !385, file: !14, line: 1973, baseType: !413, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_MEMORY_MAP", file: !14, line: 242, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!88, !73, !291, !73, !73, !324}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "AllocatePool", scope: !385, file: !14, line: 1974, baseType: !418, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !14, line: 271, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!88, !405, !60, !52}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "FreePool", scope: !385, file: !14, line: 1975, baseType: !423, size: 64, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !14, line: 288, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!88, !53}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEvent", scope: !385, file: !14, line: 1980, baseType: !428, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT", file: !14, line: 466, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!88, !131, !393, !65, !53, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "SetTimer", scope: !385, file: !14, line: 1981, baseType: !434, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_TIMER", file: !14, line: 540, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!88, !69, !438, !61}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TIMER_DELAY", file: !14, line: 520, baseType: !38)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "WaitForEvent", scope: !385, file: !14, line: 1982, baseType: !440, size: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_WAIT_FOR_EVENT", file: !14, line: 576, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!88, !60, !432, !73}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "SignalEvent", scope: !385, file: !14, line: 1983, baseType: !445, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SIGNAL_EVENT", file: !14, line: 556, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!88, !69}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "CloseEvent", scope: !385, file: !14, line: 1984, baseType: !450, size: 64, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_EVENT", file: !14, line: 592, baseType: !446)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "CheckEvent", scope: !385, file: !14, line: 1985, baseType: !452, size: 64, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CHECK_EVENT", file: !14, line: 608, baseType: !446)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "InstallProtocolInterface", scope: !385, file: !14, line: 1990, baseType: !454, size: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !14, line: 1259, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!88, !458, !312, !459, !53}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !14, line: 1235, baseType: !43)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ReinstallProtocolInterface", scope: !385, file: !14, line: 1991, baseType: !461, size: 64, offset: 1088)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1309, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!88, !89, !312, !53, !53}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallProtocolInterface", scope: !385, file: !14, line: 1992, baseType: !466, size: 64, offset: 1152)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !14, line: 1335, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!88, !89, !312, !53}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "HandleProtocol", scope: !385, file: !14, line: 1993, baseType: !471, size: 64, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !14, line: 1376, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!88, !89, !312, !52}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !385, file: !14, line: 1994, baseType: !53, size: 64, offset: 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterProtocolNotify", scope: !385, file: !14, line: 1995, baseType: !477, size: 64, offset: 1344)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_REGISTER_PROTOCOL_NOTIFY", file: !14, line: 1537, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!88, !312, !69, !52}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandle", scope: !385, file: !14, line: 1996, baseType: !482, size: 64, offset: 1408)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !14, line: 1586, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!88, !486, !312, !53, !73, !458}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !14, line: 1560, baseType: !46)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "LocateDevicePath", scope: !385, file: !14, line: 1997, baseType: !488, size: 64, offset: 1472)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_DEVICE_PATH", file: !14, line: 1612, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!88, !312, !492, !458}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DEVICE_PATH_PROTOCOL", file: !495, line: 58, baseType: !496)
!495 = !DIFile(filename: "MdePkg/Include/Protocol/DevicePath.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "6b6d593d171f69b933a87911e52d4607")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_DEVICE_PATH_PROTOCOL", file: !495, line: 43, size: 32, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !496, file: !495, line: 44, baseType: !252, size: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "SubType", scope: !496, file: !495, line: 51, baseType: !252, size: 8, offset: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !496, file: !495, line: 56, baseType: !501, size: 16, offset: 16)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 16, elements: !97)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "InstallConfigurationTable", scope: !385, file: !14, line: 1998, baseType: !503, size: 64, offset: 1536)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_CONFIGURATION_TABLE", file: !14, line: 1633, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!88, !312, !53}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "LoadImage", scope: !385, file: !14, line: 2003, baseType: !508, size: 64, offset: 1600)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_LOAD", file: !14, line: 984, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!88, !63, !89, !493, !53, !60, !458}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "StartImage", scope: !385, file: !14, line: 2004, baseType: !513, size: 64, offset: 1664)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_START", file: !14, line: 1009, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!88, !89, !73, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Exit", scope: !385, file: !14, line: 2005, baseType: !519, size: 64, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT", file: !14, line: 1037, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!88, !89, !88, !60, !148}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "UnloadImage", scope: !385, file: !14, line: 2006, baseType: !524, size: 64, offset: 1792)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_IMAGE_UNLOAD", file: !14, line: 1055, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!88, !89}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ExitBootServices", scope: !385, file: !14, line: 2007, baseType: !529, size: 64, offset: 1856)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_EXIT_BOOT_SERVICES", file: !14, line: 1071, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!88, !89, !60}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "GetNextMonotonicCount", scope: !385, file: !14, line: 2012, baseType: !534, size: 64, offset: 1920)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_MONOTONIC_COUNT", file: !14, line: 1152, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!88, !375}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "Stall", scope: !385, file: !14, line: 2013, baseType: !539, size: 64, offset: 1984)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STALL", file: !14, line: 1087, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!88, !60}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "SetWatchdogTimer", scope: !385, file: !14, line: 2014, baseType: !544, size: 64, offset: 2048)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_WATCHDOG_TIMER", file: !14, line: 1109, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!88, !60, !61, !60, !148}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ConnectController", scope: !385, file: !14, line: 2019, baseType: !549, size: 64, offset: 2112)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONNECT_CONTROLLER", file: !14, line: 347, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!88, !89, !458, !493, !63}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DisconnectController", scope: !385, file: !14, line: 2020, baseType: !554, size: 64, offset: 2176)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_DISCONNECT_CONTROLLER", file: !14, line: 380, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!88, !89, !89, !89}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocol", scope: !385, file: !14, line: 2025, baseType: !559, size: 64, offset: 2240)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL", file: !14, line: 1418, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!88, !89, !312, !52, !89, !89, !131}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "CloseProtocol", scope: !385, file: !14, line: 2026, baseType: !564, size: 64, offset: 2304)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CLOSE_PROTOCOL", file: !14, line: 1450, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!88, !89, !312, !89, !89}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "OpenProtocolInformation", scope: !385, file: !14, line: 2027, baseType: !569, size: 64, offset: 2368)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION", file: !14, line: 1484, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!88, !89, !312, !573, !73}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1465, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_OPEN_PROTOCOL_INFORMATION_ENTRY", file: !14, line: 1460, size: 192, elements: !577)
!577 = !{!578, !579, !580, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "AgentHandle", scope: !576, file: !14, line: 1461, baseType: !89, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ControllerHandle", scope: !576, file: !14, line: 1462, baseType: !89, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !576, file: !14, line: 1463, baseType: !131, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "OpenCount", scope: !576, file: !14, line: 1464, baseType: !131, size: 32, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolsPerHandle", scope: !385, file: !14, line: 2032, baseType: !583, size: 64, offset: 2432)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PROTOCOLS_PER_HANDLE", file: !14, line: 1514, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!88, !89, !587, !73}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "LocateHandleBuffer", scope: !385, file: !14, line: 2033, baseType: !590, size: 64, offset: 2496)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE_BUFFER", file: !14, line: 1659, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!88, !486, !312, !53, !73, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "LocateProtocol", scope: !385, file: !14, line: 2034, baseType: !596, size: 64, offset: 2560)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !14, line: 1686, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!88, !312, !53, !52}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "InstallMultipleProtocolInterfaces", scope: !385, file: !14, line: 2035, baseType: !601, size: 64, offset: 2624)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1284, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!88, !458, null}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "UninstallMultipleProtocolInterfaces", scope: !385, file: !14, line: 2036, baseType: !606, size: 64, offset: 2688)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_MULTIPLE_PROTOCOL_INTERFACES", file: !14, line: 1354, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!88, !89, null}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "CalculateCrc32", scope: !385, file: !14, line: 2041, baseType: !611, size: 64, offset: 2752)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CALCULATE_CRC32", file: !14, line: 1189, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!88, !53, !60, !324}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "CopyMem", scope: !385, file: !14, line: 2046, baseType: !616, size: 64, offset: 2816)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_COPY_MEM", file: !14, line: 1205, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !53, !53, !60}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "SetMem", scope: !385, file: !14, line: 2047, baseType: !621, size: 64, offset: 2880)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_MEM", file: !14, line: 1221, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !53, !60, !252}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "CreateEventEx", scope: !385, file: !14, line: 2048, baseType: !626, size: 64, offset: 2944)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CREATE_EVENT_EX", file: !14, line: 495, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!88, !131, !393, !65, !630, !632, !432}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !136, file: !14, line: 2124, baseType: !60, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ConfigurationTable", scope: !136, file: !14, line: 2129, baseType: !636, size: 64, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 2064, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EFI_CONFIGURATION_TABLE", file: !14, line: 2055, size: 192, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !638, file: !14, line: 2059, baseType: !313, size: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !638, file: !14, line: 2063, baseType: !53, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DeviceHandle", scope: !128, file: !127, line: 53, baseType: !89, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "FilePath", scope: !128, file: !127, line: 54, baseType: !493, size: 64, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !128, file: !127, line: 56, baseType: !53, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptionsSize", scope: !128, file: !127, line: 61, baseType: !131, size: 32, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "LoadOptions", scope: !128, file: !127, line: 62, baseType: !53, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ImageBase", scope: !128, file: !127, line: 67, baseType: !53, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ImageSize", scope: !128, file: !127, line: 68, baseType: !61, size: 64, offset: 576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ImageCodeType", scope: !128, file: !127, line: 69, baseType: !405, size: 32, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ImageDataType", scope: !128, file: !127, line: 70, baseType: !405, size: 32, offset: 672)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Unload", scope: !128, file: !127, line: 71, baseType: !524, size: 64, offset: 704)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!653 = distinct !DIGlobalVariable(name: "TimerPeriodic", scope: !2, file: !14, line: 515, type: !227, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!655 = distinct !DIGlobalVariable(name: "EFI_NATIVE_INTERFACE", scope: !2, file: !14, line: 1234, type: !227, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "bobKey", scope: !2, file: !77, line: 28, type: !91, isLocal: false, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "change", scope: !660, file: !77, line: 93, type: !60, isLocal: true, isDefinition: true)
!660 = distinct !DISubprogram(name: "Demo1BobTimerHandler", scope: !77, file: !77, line: 88, type: !67, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !661)
!661 = !{!662, !663, !664, !665, !666, !667}
!662 = !DILocalVariable(name: "Event", arg: 1, scope: !660, file: !77, line: 89, type: !69)
!663 = !DILocalVariable(name: "Context", arg: 2, scope: !660, file: !77, line: 90, type: !53)
!664 = !DILocalVariable(name: "Data", scope: !660, file: !77, line: 94, type: !60)
!665 = !DILocalVariable(name: "Mode", scope: !660, file: !77, line: 95, type: !60)
!666 = !DILocalVariable(name: "BufferSize", scope: !660, file: !77, line: 96, type: !60)
!667 = !DILocalVariable(name: "Status", scope: !660, file: !77, line: 101, type: !88)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "Demo1_Bob_PROTOCOL", file: !669, line: 42, baseType: !670)
!669 = !DIFile(filename: "EmulatorPkg/Demo1_Bob/Demo1_Bob.h", directory: "/home/arun/Desktop/darpa_ex1/UIUC_D/mitigation/aliceBob/edk2", checksumkind: CSK_MD5, checksum: "40cbf922a1df2e180721e1b98be47af9")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Demo1_Bob_PROTOCOL", file: !669, line: 59, size: 64, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Demo1BobDataProvider", scope: !670, file: !669, line: 60, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOB_CB_TYPE", file: !669, line: 49, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!88, !677, !53, !52, !60}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!678 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!679 = !{i32 2, !"CodeView", i32 1}
!680 = !{i32 2, !"Debug Info Version", i32 3}
!681 = !{i32 1, !"wchar_size", i32 2}
!682 = !{i32 7, !"PIC Level", i32 2}
!683 = !{i32 1, !"Code Model", i32 1}
!684 = !{i32 1, !"ThinLTO", i32 0}
!685 = !{i32 1, !"EnableSplitLTOUnit", i32 1}
!686 = !{!"clang version 12.0.0 (https://github.com/checkedc-purdue/checkedc-llvm-project.git 27fde796053109cdd0b9787c7168cab042e1ea94)"}
!687 = distinct !DISubprogram(name: "Demo1BobDataProvider", scope: !77, file: !77, line: 330, type: !675, scopeLine: 336, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696}
!689 = !DILocalVariable(name: "This", arg: 1, scope: !687, file: !77, line: 331, type: !677)
!690 = !DILocalVariable(name: "Address", arg: 2, scope: !687, file: !77, line: 332, type: !53)
!691 = !DILocalVariable(name: "Dest", arg: 3, scope: !687, file: !77, line: 333, type: !52)
!692 = !DILocalVariable(name: "Size", arg: 4, scope: !687, file: !77, line: 334, type: !60)
